app/controllers/api/users_controller.rb

  def create
    if user_params[:password].size <6
      render json: ['Please create a password greater than 6 characters.'],status: 401
      return
    end
    @user = User.new(user_params)
    if User.find_by(username: user_params[:username])
      render json: ['Username already taken.'], status: 401
    elsif User.find_by(email: user_params[:email])
      render json:  ["A user has already registered an account with this email."], status: 401

    elsif !user_params[:email].include?('@')
      render json: ['Invalid email.  Please try again.'], status: 401
    elsif @user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jaja"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bbob@"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"