app/models/user.rb

  def self.find_by_credentials(uname, pw)
    @u = User.find_by(username: uname);
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Ray"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(32)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3KKLmzS9MMTfSQwXbgQ77Tyl_sWiUHQKF2R10dBaaHA"], ["updated_at", "2021-03-17 03:36:58.497150"], ["id", 16]]